[M_SwallowedWhole MissionDefinition]
MissionDescription="A bandit known as Shorty defaced one of Scooter's Catch-A-Ride stations. Scooter has asked you to find Shorty in [place]The Fridge[-place] and demand he repay Scooter for the damages. Just kidding. Scooter wants him dead. "
TurnInDescription="You successfully cut that midget's life a little... SHORT. Eh? Eh?"

[M_SwallowedWhole:KillwithShock MissionObjectiveDefinition]
ProgressMessage="...with a shock weapon"
